x = int(input("Введите номер квартиры :"))
if x > 144 or x < 1:
    print("Такой квартиры не существует в этом доме!")
if x >= 1 and x <= 4:
    print("Квартира находится в 1 подъезде,на 1 этаже")
if x >4 and x <= 8:
    print("Квартира находится в 1 подъезде,на 2 этаже")
if x > 8 and x <= 12:
    print("Квартира находится в 1 подъезде,на 3 этаже")
if x > 12 and x <= 16:
    print("Квартира находится в 1 подъезде,на 4 этаже")
if x > 16 and x <= 20:
    print("Квартира находится в 1 подъезде,на 5 этаже")
if x >= 20 and x <= 24:
    print("Квартира находится в 1 подъезде,на 6 этаже")
if x > 24 and x <= 28:
    print("Квартира находится в 1 подъезде,на 7 этаже")
if x > 28 and x <= 32:
    print("Квартира находится в 1 подъезде,на 8 этаже")
if x > 32 and x <= 36:
    print("Квартира находится в 1 подъезде,на 9 этаже")
if x > 36 and x <= 40:
    print("Квартира находится в 2 подъезде,на 1 этаже")
if x > 40 and x <= 44:
    print("Квартира находится в 2 подъезде,на 2 этаже")
if x > 44 and x <= 48:
    print("Квартира находится в 2 подъезде,на 3 этаже")
if x > 48 and x <= 52:
    print("Квартира находится в 2 подъезде,на 4 этаже")
if x > 52 and x <= 56:
    print("Квартира находится в 2 подъезде,на 5 этаже")
if x > 56 and x <= 60:
    print("Квартира находится в 2 подъезде,на 6 этаже")
if x > 60 and x <= 64:
    print("Квартира находится в 2 подъезде,на 7 этаже")
if x > 64 and x <= 68:
    print("Квартира находится в 2 подъезде,на 8 этаже")
if x > 68 and x <= 72:
    print("Квартира находится в 2 подъезде,на 9 этаже")
if x > 72 and x <= 76:
    print("Квартира находится в 3 подъезде,на 1 этаже")
if x > 76 and x <= 80:
    print("Квартира находится в 3 подъезде,на 2 этаже")
if x > 80 and x <= 84:
    print("Квартира находится в 3 подъезде,на 3 этаже")
if x > 84 and x <= 88:
    print("Квартира находится в 3 подъезде,на 4 этаже")
if x > 88 and x <= 92:
    print("Квартира находится в 3 подъезде,на 5 этаже")
if x > 92 and x <= 96:
    print("Квартира находится в 3 подъезде,на 6 этаже")
if x > 96 and x <= 100:
    print("Квартира находится в 3 подъезде,на 7 этаже")
if x > 100 and x <= 104:
    print("Квартира находится в 3 подъезде,на 8 этаже")
if x > 104 and x <= 108:
    print("Квартира находится в 3 подъезде,на 9 этаже")
if x > 108 and x <= 112:
    print("Квартира находится в 4 подъезде,на 1 этаже")
if x > 112 and x <= 116:
    print("Квартира находится в 4 подъезде,на 2 этаже")
if x > 116 and x <= 120:
    print("Квартира находится в 4 подъезде,на 3 этаже")
if x > 120 and x <= 124:
    print("Квартира находится в 4 подъезде,на 4 этаже")
if x > 124 and x <= 128:
    print("Квартира находится в 4 подъезде,на 5 этаже")
if x > 128 and x <= 132:
    print("Квартира находится в 4 подъезде,на 6 этаже")
if x > 132 and x <= 136:
    print("Квартира находится в 4 подъезде,на 7 этаже")
if x > 136 and x <= 140:
    print("Квартира находится в 4 подъезде,на 8 этаже")
if x > 140 and x <= 144:
    print("Квартира находится в 4 подъезде,на 9 этаже")